### Access Dataframe

In [61]:
import pandas as pd
import numpy as np

### Functions

In [ ]:
1. pd.DataFrame()
2. pd.Series()
3. df.columns
4. df.index
5. df.axes
6. df.dtypes
7. df.select_dtypes()
8. df.info()
9. df.describe()
10. df.shape

In [7]:
array1 = np.random.randint(1,30, size = (6,5))
df = pd.DataFrame(array1, columns = list('ABCDE'),index = list("PYTHON"))
df

    A   B   C   D   E
P  13  24  15   8  27
Y   1  22  29   8   2
T  21  13  29  26   6
H  28  27  25  21  20
O  27  12  10  14  16
N   1  29  12  14  11

In [8]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [9]:
df.index

Index(['P', 'Y', 'T', 'H', 'O', 'N'], dtype='object')

In [11]:
array1 = np.random.randint(1,30, size = (6,5))
df = pd.DataFrame(array1, columns = list('ABCDE'))
df.index

RangeIndex(start=0, stop=6, step=1)

In [17]:
array1 = np.random.randint(1,30, size = (6,5))
df = pd.DataFrame(array1, columns = list('ABCDE'),index = list("PYTHON"))
df

    A   B   C   D   E
P   1  27  22  21   1
Y  18  25  14  14  19
T  18  12  16  25  21
H  14  15  13   7   6
O  12  21  22  17  17
N  18  15  22  18  21

In [19]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [20]:
df.index

Index(['P', 'Y', 'T', 'H', 'O', 'N'], dtype='object')

In [22]:
df.axes

[Index(['P', 'Y', 'T', 'H', 'O', 'N'], dtype='object'),
 Index(['A', 'B', 'C', 'D', 'E'], dtype='object')]

In [24]:
df.dtypes

A    int64
B    int64
C    int64
D    int64
E    int64
dtype: object

In [27]:
dict1 = {'A':[2,5,6,7,8],
        'B':(10,20,3.0,40,50),
        'C' : np.array([2,3,5,'python',7]),
        'D':np.arange(100,105),
        'E' : np.array(['Pune',"mumbai",'Delhi','Chennai','Hyderabad'])}

df = pd.DataFrame(dict1)
df

   A     B       C    D          E
0  2  10.0       2  100       Pune
1  5  20.0       3  101     mumbai
2  6   3.0       5  102      Delhi
3  7  40.0  python  103    Chennai
4  8  50.0       7  104  Hyderabad

In [29]:
df.dtypes

A      int64
B    float64
C     object
D      int64
E     object
dtype: object

In [31]:
df.select_dtypes(include=[int,float])

   A     B    D
0  2  10.0  100
1  5  20.0  101
2  6   3.0  102
3  7  40.0  103
4  8  50.0  104

In [33]:
df.select_dtypes(include=[object])

        C          E
0       2       Pune
1       3     mumbai
2       5      Delhi
3  python    Chennai
4       7  Hyderabad

In [34]:
df.select_dtypes(exclude=[object])

   A     B    D
0  2  10.0  100
1  5  20.0  101
2  6   3.0  102
3  7  40.0  103
4  8  50.0  104

In [36]:
df.describe()

              A          B           D
count  5.000000   5.000000    5.000000
mean   5.600000  24.600000  102.000000
std    2.302173  19.894723    1.581139
min    2.000000   3.000000  100.000000
25%    5.000000  10.000000  101.000000
50%    6.000000  20.000000  102.000000
75%    7.000000  40.000000  103.000000
max    8.000000  50.000000  104.000000

In [37]:
df.describe(include='all')

               A          B    C           D     E
count   5.000000   5.000000    5    5.000000     5
unique       NaN        NaN    5         NaN     5
top          NaN        NaN    2         NaN  Pune
freq         NaN        NaN    1         NaN     1
mean    5.600000  24.600000  NaN  102.000000   NaN
std     2.302173  19.894723  NaN    1.581139   NaN
min     2.000000   3.000000  NaN  100.000000   NaN
25%     5.000000  10.000000  NaN  101.000000   NaN
50%     6.000000  20.000000  NaN  102.000000   NaN
75%     7.000000  40.000000  NaN  103.000000   NaN
max     8.000000  50.000000  NaN  104.000000   NaN

In [39]:
df.shape

(5, 5)

In [41]:
row_count = df.shape[0]
print("Number of Rows :",row_count)
col_count = df.shape[1]
print("Number of Columns :",col_count)

Number of Rows : 5
Number of Columns : 5

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      float64
 2   C       5 non-null      object
 3   D       5 non-null      int64
 4   E       5 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [45]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [48]:
df.columns = list('asdfg')
df

   a     s       d    f          g
0  2  10.0       2  100       Pune
1  5  20.0       3  101     mumbai
2  6   3.0       5  102      Delhi
3  7  40.0  python  103    Chennai
4  8  50.0       7  104  Hyderabad

In [51]:
array1 = np.random.randint(1,30, size = (6,5))
df1 = pd.DataFrame(array1, columns = list('ABCDE'),index = list("PYTHON"))
df1

    A   B   C   D   E
P  25  23  22  28  12
Y  29   5  17  18  27
T  18  13  20  29   5
H  25  11  28  15  21
O  24   3  23   3   7
N   8  12   7  10   8

In [57]:
df1.columns = list('qwert')
df1.index = list('asdfgh')
df1

    q   w   e   r   t
a  25  23  22  28  12
s  29   5  17  18  27
d  18  13  20  29   5
f  25  11  28  15  21
g  24   3  23   3   7
h   8  12   7  10   8

In [59]:
df1.columns = np.arange(0,5)
df1.index = np.arange(100,106)
df1

      0   1   2   3   4
100  25  23  22  28  12
101  29   5  17  18  27
102  18  13  20  29   5
103  25  11  28  15  21
104  24   3  23   3   7
105   8  12   7  10   8

In [62]:
array1 = np.random.randint(1,30, size = (6,5))
df1 = pd.DataFrame(array1, columns = list('ABCDE'),index = list("PYTHON"))
df1['A']

P    15
Y     7
T    24
H    11
O    28
N    18
Name: A, dtype: int64

In [63]:
df1 = pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []